{
  "personal": {
    "name": "Md. Toufiqul Islam",
    "title": "Software Engineer | Node.js, Golang, Docker, Kubernetes",
    "profileImage": "https://images.unsplash.com/photo-1507003211169-0a1dd7228f2d?w=200&h=200&fit=crop&crop=face",
    "contact": {
      "email": "toufiq.austcse@gmail.com",
      "location": "Dhaka, Bangladesh"
    }
  },
  "navigation": [
    {
      "id": "contact",
      "label": "//Linkdin",
      "href": "https://www.linkedin.com/in/toufiqcse36/"
    },
    {
      "id": "github",
      "label": "//github",
      "href": "https://github.com/toufiq-austcse"
    }
  ],
  "about": {
    "title": "//about",
    "content": "Hi, I’m Md. Toufiqul Islam, a software engineer with 6 years of professional experience working in high volume and fast paced environments. Skilled in creating scalable and impactful products using variety of technologies including Node.js, Go and kubernetes & PostgresSQL. I’m passionate about creating robust systems, mentoring engineers, and optimizing performance at scale. I’d love to contribute to impactful projects where I can apply my technical expertise and leadership skills."
  },
  "workExperience": {
    "title": "//work experience",
    "jobs": [
      {
        "id": "jiak",
        "company": "Jiak Technology",
        "position": "Senior Software Engineer (Remote)",
        "period": "September 2025 – Present",
        "location": "Singapore",
        "description": "JIAK is a Singapore-based SaaS startup modernizing the F&B industry with an all-in-one platform for reservations, digital ordering, POS, and analytics—helping restaurants streamline operations and grow through smarter tech.",
        "achievements": [
          "Owned the end-to-end development of core merchant services, including Digital Menu Management, a real-time Waitlist Queuing system, and automated merchant-facing Notifications",
          "Developed the core public-facing RESTful API to power the customer reservation platform, building foundational features for restaurant discovery and real-time table booking",
          "Executed a strategic refactoring of a legacy codebase, establishing clearer design patterns that improved code\nreusability and accelerated the pace of future feature development",
          "Implemented an asynchronous job queue using Redis and BullMQ to reliably offload background tasks, such as\nsending Twilio notifications, which improved API response times",
          "Partnered with frontend and design teams to define clear API contracts, ensuring seamless data integration and a\nconsistent user experience across the platform"
        ],
        "technologies": [
          "Node.js",
          "PostgreSQL",
          "Redis",
          "BullMQ",
          "Twilio",
          "WebSocket",
          "Docker",
          "Kubernetes"
        ]
      },
      {
        "id": "10minuteschool",
        "company": "10 Minute School",
        "position": "Lead Software Engineer",
        "period": "August 2019 – August 2025",
        "location": "Bangladesh",
        "description": "10 Minute School is Bangladesh's largest online learning platform, offering free classes, tutorials, and quizzes for students (grades 1–12), university admissions, and skill development.",
        "achievements": [
          "Promoted through Software Engineer and Senior Software Engineer to Lead for consistent high performance and leadership",
          "Rearchitected the caching strategy for the critical Central Routine API, slashing peak-hour p99 latency by over 85% to ensure a reliable user experience under high load",
          "Led Live Video Streaming infrastructure for conducting live classes with real-time interactions. Serves around 30k students participating in different live classes and handling approximately 100k RPM during peak hours every day",
          "Architected and deployed an in-house Video Processing Pipeline, reducing monthly operational costs by 75% while processing over 800 videos",
          "Reduced cloud infrastructure costs by 60% through strategic optimization initiatives",
          "Led a sub-team to develop central Learning Report service that improved user engagement by providing comprehensive weekly and monthly reports",
          "Led end-to-end implementation of OpenTelemetry across microservices that enhanced system monitoring capabilities",
          "Developed REST API for different microservices of 10MS Billing System, handling 10k+ transactions every day",
          "Designed and led the development of an automated push notification system using event-driven Microservice Architecture",
          "Implemented REST API for Exam Service, resulting in onboarding 140k new users",
          "Collaborated with cross functional teams to design, develop, and deploy features to production",
          "Monitored post-production feature performance to identify and implement further optimization strategies",
          "Mentored junior engineers & interns to build production ready services",
          "Integrated AWS tools like S3, SNS, SQS and Lambda with the application"
        ],
        "technologies": [
          "Node.js",
          "Go(Golang)",
          "NestJS",
          "RabbitMQ",
          "AWS",
          "Firebase",
          "Docker",
          "Kubernetes",
          "PostgreSQL",
          "MongoDB"
        ]
      },
      {
        "id": "khamare",
        "company": "Khamar-e",
        "position": "Full Stack Developer",
        "period": "February 2019 – July 2019",
        "location": "Bangladesh",
        "description": "Khamar-e is an agri-tech startup working towards a data-driven farming and supply chain ecosystem in Bangladesh",
        "achievements": [
          "Developed front-end & back-end of a Health Tracker IOT device for tracking the activity of cattle"
        ],
        "technologies": [
          "Node.js",
          "RabbitMQ",
          "MongoDB",
          "React"
        ]
      }
    ]
  },
  "personalProjects": {
    "title": "//personal projects",
    "projects": [
      {
        "id": "video-touch",
        "name": "Video Touch",
        "description": "A Video Hosting & Streaming Platform",
        "githubUrl": "https://github.com/toufiq-austcse/video-touch",
        "achievements": [
          "Implemented video transcoding and thumbnail generation with an asynchronous job queue",
          "Streamed videos on demand (VOD) using a Content Delivery Network (CDN) for optimized performance",
          "Developed a user-friendly dashboard with Next.js and shadcn/ui for a seamless user experience"
        ],
        "technologies": [
          "Node.js",
          "NestJS",
          "GraphQL",
          "MongoDB",
          "RabbitMQ",
          "BullMQ",
          "S3",
          "CloudFront",
          "Github Action",
          "Docker",
          "Next.js",
          "shadcn/ui"
        ]
      },
      {
        "id": "deploybl",
        "name": "Deploybl",
        "description": "Platform as a Service (PaaS)",
        "githubUrl": "https://github.com/toufiq-austcse/deploybl",
        "achievements": [
          "Full-Stack application to simplify the deployment and management of applications",
          "Deploy any application written in any language with just two clicks. No need to buy and configure a server",
          "Automatic unique URL generation for each deployed application. No need to buy and configure domain"
        ],
        "technologies": [
          "Go(Golang)",
          "Gin",
          "MongoDB",
          "RabbitMQ",
          "Traefik",
          "S3",
          "Firebase",
          "Docker",
          "Next.js",
          "shadcn/ui"
        ]
      }
    ]
  }
}